app/controllers/songs_controller.rb

  def upload
    CSV.foreach(Rails.root.join('db','songs.csv'), headers: true) do |song|
      binding.pry
      song = Song.new(:title => song[0])
      song.artist.find_or_create_by(:name => song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-06-06 18:52:17.059111"], ["updated_at", "2018-06-06 18:52:17.059111"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2018-06-06 18:52:17.061003"], ["updated_at", "2018-06-06 18:52:17.061003"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]